Autodesk.Revit.DB.GeomCombinationSet
A set that contains GeomCombination objects.

Autodesk.Revit.DB.GeomCombinationSet.Insert(Autodesk.Revit.DB.GeomCombination)
System.Int32
Insert the specified element into the set.
item: The GeomCombination to be inserted into the set.
Returns: Returns whether the GeomCombination was inserted into the set.

Autodesk.Revit.DB.GeomCombinationSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.GeomCombinationSet.ReverseIterator
Autodesk.Revit.DB.GeomCombinationSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.GeomCombinationSet.ForwardIterator
Autodesk.Revit.DB.GeomCombinationSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.GeomCombinationSet.Erase(Autodesk.Revit.DB.GeomCombination)
System.Int32
Removes a specified GeomCombination from the set.
item: The GeomCombination to be erased.
Returns: The number of GeomCombinations that were erased from the set.

Autodesk.Revit.DB.GeomCombinationSet.Contains(Autodesk.Revit.DB.GeomCombination)
System.Boolean
Tests for the existence of an GeomCombination within the set.
item: The element to be searched for.
Returns: The Contains method returns True if the GeomCombination is within the set, otherwise False.

Autodesk.Revit.DB.GeomCombinationSet.Clear
void
Removes every item GeomCombination the set, rendering it empty.

Autodesk.Revit.DB.GeomCombinationSet.Size
System.Int32
get
Returns the number of GeomCombinations that are in the set.

Autodesk.Revit.DB.GeomCombinationSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.